In [5]:
#import
import sqlite3
import pandas as pd

In [15]:
connection = sqlite3.connect('shows.sqlite')
cursor=connection.cursor()

In [3]:
connection

In [11]:
test.to_sql("my_show", connection, if_exists='fail',index=False)

In [8]:
test=pd.DataFrame({"Candy":["Ice Cream","Twizzler"],"Calories":[120,350]})

In [12]:
test

       Candy  Calories
0  Ice Cream       120
1   Twizzler       350

In [34]:
pd.read_sql_query("Select * from my_show",connection)

   index      Candy  Calories
0      0  Ice Cream       120
1      1   Twizzler       350

In [32]:
for row in test.itertuples():
    print(row[1])

Ice Cream
Twizzler